Revit 2027 API
RebarFreeFormAccessor.SetCurves(IList<CurveLoop>) Method
 Set the curves into a free form Rebar. Will throw exception if the rebar has valid constraints.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarFreeFormValidationResult SetCurves(
	IList<CurveLoop> curves
)
Public Function SetCurves (
	curves As IList(Of CurveLoop)
) As RebarFreeFormValidationResult
public:
RebarFreeFormValidationResult SetCurves(
	IList<CurveLoop^>^ curves
)
member SetCurves :
        curves : IList<CurveLoop> -> RebarFreeFormValidationResult
Parameters
curves IList<CurveLoop>
 Each curve loop represents a bar in the set.
Return Value
RebarFreeFormValidationResult
 Returns Success if everything is ok, otherwise the failure reason.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  This RebarFreeFormAccessor Rebar is constrained.
Remarks
This function can fail due to following reasons:
The array of CurveLoops is empty.
At least one CurveLoop is empty.
At least one CurveLoop contains an unbounded curve.
A rebar constructed from curves can't be bent according to the bending radius.
See Also
Reference
RebarFreeFormAccessor Class
SetCurves Overload
Autodesk.Revit.DB.Structure Namespace